<!-- dflook/terraform-github-actions {"workspace":"default","backend":"847a3a261af978318edaf62f28fdb49091c670c88368e5c9819d6e380e8badf3","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #285 at https://github.com/dflook/terraform-github-actions/actions/runs/3526569819","plan_hash":"69a167b440836a371e36ba63181b7921c2609b3bb34527142170b9e09556dddd","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`<details><summary>With variables</summary>

```hcl
length = 10

```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "lpwb6TY4U4" -> (known after apply)
  ~ foreach = "i53I7VTeM1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #285](https://github.com/dflook/terraform-github-actions/actions/runs/3526569819)